---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.Dispose
source: html/29c459ac-5f4d-8396-ab15-7d26e0f2d148.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.Dispose Method

Releases all resources used by the IFCExtrusionCalculatorOptions

## Syntax (C#)
```csharp
public void Dispose()
```